{
  "word_to_idx": {
    "2024": 1,
    "2025": 2,
    "4s": 3,
    "about": 4,
    "aede": 5,
    "aedes": 6,
    "aegypti": 7,
    "aerial": 8,
    "after": 9,
    "afternoon": 10,
    "against": 11,
    "ai": 12,
    "albopictus": 13,
    "alert": 14,
    "all": 15,
    "and": 16,
    "ang": 17,
    "anong": 18,
    "app": 19,
    "are": 20,
    "area": 21,
    "areas": 22,
    "at": 23,
    "avoid": 24,
    "ayoko": 25,
    "bakit": 26,
    "balatas": 27,
    "barangay": 28,
    "bedok": 29,
    "bicol": 30,
    "bishan": 31,
    "bleeding": 32,
    "blood": 33,
    "bmc": 34,
    "breed": 35,
    "breeding": 36,
    "bye": 37,
    "cadet": 38,
    "campaign": 39,
    "can": 40,
    "case": 41,
    "cases": 42,
    "causes": 43,
    "center": 44,
    "central": 45,
    "check": 46,
    "city": 47,
    "clean": 48,
    "clinic": 49,
    "cluster": 50,
    "community": 51,
    "concepcion": 52,
    "containers": 53,
    "count": 54,
    "cure": 55,
    "dangerous": 56,
    "dayangdang": 57,
    "dengue": 58,
    "destroy": 59,
    "do": 60,
    "doctor": 61,
    "does": 62,
    "done": 63,
    "dont": 64,
    "drum": 65,
    "earn": 66,
    "east": 67,
    "eggs": 68,
    "eliminate": 69,
    "elite": 70,
    "emergency": 71,
    "evening": 72,
    "exit": 73,
    "explain": 74,
    "feature": 75,
    "features": 76,
    "feel": 77,
    "fever": 78,
    "flooding": 79,
    "flower": 80,
    "fog": 81,
    "fogging": 82,
    "for": 83,
    "fumigation": 84,
    "gabi": 85,
    "gamitin": 86,
    "gamot": 87,
    "gamutin": 88,
    "general": 89,
    "go": 90,
    "good": 91,
    "goodbye": 92,
    "gov": 93,
    "guardian": 94,
    "habagat": 95,
    "habitat": 96,
    "hapon": 97,
    "have": 98,
    "hello": 99,
    "help": 100,
    "hey": 101,
    "hi": 102,
    "high": 103,
    "hospital": 104,
    "hougang": 105,
    "how": 106,
    "huh": 107,
    "i": 108,
    "if": 109,
    "igualdad": 110,
    "intel": 111,
    "ireport": 112,
    "is": 113,
    "itlog": 114,
    "jurong": 115,
    "kamusta": 116,
    "katambay": 117,
    "katawan": 118,
    "kio": 119,
    "know": 120,
    "kumita": 121,
    "kumusta": 122,
    "kung": 123,
    "lagnat": 124,
    "lamok": 125,
    "leaderboard": 126,
    "level": 127,
    "levels": 128,
    "liboton": 129,
    "like": 130,
    "magandang": 131,
    "magreport": 132,
    "magrequest": 133,
    "maiwasan": 134,
    "malalaman": 135,
    "malathion": 136,
    "map": 137,
    "mapa": 138,
    "masakit": 139,
    "may": 140,
    "mean": 141,
    "medical": 142,
    "medicine": 143,
    "mission": 144,
    "missions": 145,
    "mo": 146,
    "monsoon": 147,
    "morning": 148,
    "mosquito": 149,
    "mosquitoes": 150,
    "naga": 151,
    "nagdudulot": 152,
    "naglalagay": 153,
    "nagtatayo": 154,
    "nea": 155,
    "nearest": 156,
    "ng": 157,
    "north": 158,
    "nuh": 159,
    "of": 160,
    "ok": 161,
    "okay": 162,
    "ospital": 163,
    "outbreak": 164,
    "paalam": 165,
    "paano": 166,
    "pagiwas": 167,
    "paracetamol": 168,
    "peafrancia": 169,
    "pequea": 170,
    "pesticide": 171,
    "planning": 172,
    "platelet": 173,
    "points": 174,
    "polyclinic": 175,
    "post": 176,
    "prevent": 177,
    "prevention": 178,
    "project": 179,
    "protection": 180,
    "punggol": 181,
    "rain": 182,
    "rainy": 183,
    "rank": 184,
    "rash": 185,
    "region": 186,
    "remedy": 187,
    "repeat": 188,
    "report": 189,
    "reporting": 190,
    "request": 191,
    "risk": 192,
    "sa": 193,
    "saan": 194,
    "salamat": 195,
    "schedule": 196,
    "search": 197,
    "season": 198,
    "seek": 199,
    "seng": 200,
    "sengkang": 201,
    "sg": 202,
    "sgh": 203,
    "sige": 204,
    "signs": 205,
    "singapore": 206,
    "sintomas": 207,
    "site": 208,
    "sites": 209,
    "species": 210,
    "spray": 211,
    "stop": 212,
    "submit": 213,
    "surveillance": 214,
    "symptoms": 215,
    "system": 216,
    "tabuco": 217,
    "tagulan": 218,
    "take": 219,
    "tampines": 220,
    "tan": 221,
    "thank": 222,
    "thanks": 223,
    "thats": 224,
    "thermal": 225,
    "this": 226,
    "tiger": 227,
    "tire": 228,
    "to": 229,
    "tock": 230,
    "treat": 231,
    "treatment": 232,
    "triangulo": 233,
    "ttsh": 234,
    "tungkol": 235,
    "typhoon": 236,
    "ulan": 237,
    "umaga": 238,
    "unclear": 239,
    "understand": 240,
    "up": 241,
    "use": 242,
    "vase": 243,
    "vector": 244,
    "warning": 245,
    "water": 246,
    "weather": 247,
    "what": 248,
    "when": 249,
    "where": 250,
    "which": 251,
    "wolbachia": 252,
    "woodlands": 253,
    "xp": 254,
    "yishun": 255,
    "you": 256,
    "zone": 257
  },
  "vocab_size": 258,
  "max_seq_len": 15
}